In [61]:
import pandas as pd
import numpy as np
import os as os
from sqlalchemy import create_engine
from datetime import timedelta
train=pd.read_csv("train.csv")
fulfilment=pd.read_csv('fulfilment_center_info.csv')
meal_info=pd.read_csv('meal_info.csv')
engine = create_engine('sqlite:///FoodDemand.db')

In [62]:
## Have to comment out after first run or will always produce an error that table already exsists.
#train.to_sql('FoodDemand_sales',engine)
#meal_info.to_sql('FoodDemand_mealinfo',engine)
#fulfilment.to_sql('FoodDemand_fulfilment',engine)

In [63]:
meal_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   meal_id   51 non-null     int64
 1   category  51 non-null     object
 2   cuisine   51 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

In [64]:
x=pd.read_sql_query('select * from FoodDemand_mealinfo', engine)
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   index     51 non-null     int64
 1   meal_id   51 non-null     int64
 2   category  51 non-null     object
 3   cuisine   51 non-null     object
dtypes: int64(2), object(2)
memory usage: 1.7+ KB

In [65]:
y=pd.read_sql('select * from FoodDemand_sales', engine)
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456548 entries, 0 to 456547
Data columns (total 10 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   index                  456548 non-null  int64
 1   id                     456548 non-null  int64
 2   week                   456548 non-null  int64
 3   center_id              456548 non-null  int64
 4   meal_id                456548 non-null  int64
 5   checkout_price         456548 non-null  float64
 6   base_price             456548 non-null  float64
 7   emailer_for_promotion  456548 non-null  int64
 8   homepage_featured      456548 non-null  int64
 9   num_orders             456548 non-null  int64
dtypes: float64(2), int64(8)
memory usage: 34.8 MB

In [67]:
meal1062=pd.read_sql('select * from FoodDemand_sales WHERE meal_id = 1062', engine)
meal1062.head()

,index,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,7,1499955,1,55,1062,182.36,183.36,0,0,391
1,40,1351400,1,24,1062,184.36,182.36,0,0,514
2,84,1057835,1,11,1062,184.36,182.36,0,0,798
3,125,1231510,1,83,1062,170.78,170.78,0,0,284
4,164,1402151,1,32,1062,175.60,174.60,0,0,256

In [69]:
pd.crosstab(meal1062.week, meal1062.meal_id, values=meal1062.num_orders, aggfunc='sum')

meal_id   1062
week
1        28943
2        26695
3        27844
4        31144
5        29324
...        ...
141      32729
142      34990
143      37333
144      35981
145      36144

[145 rows x 1 columns]